#-*- coding:utf-8 -*-
__author__ = 'zhyq'

#0-100 reseved
#100-200 used
#200~210 not used
#300~310 not ued
MESSAGE = {
    0: u'success',
    1: u'未知错误',
    2: u'url 找不到',
    3: u'参数错误',
    4: u'未登录',

    40: u'邮箱或密码不能为空',
    41: u'邮箱或密码错误',
    42: u'临时密码已发送邮箱',
    49: u'登录失败',
    50: u'社交登录失败',
    51: u'账号已被绑定',
    52: u'Email 已经被注册',
    53: u'Email 不存在',
    60: u'评论不能为空',
    61: u'评论含有违禁字符，请重新填写',
    100: u'昵称不能重复',
    101: u'昵称长度为2-16个',
    104: u'你已经顶过该评论',

    110: u'图片处理错误',
    111: u'图片小于规定尺寸',
    112: u'图片上传失败',
    113: u'图片存储失败',
    404: u'not found',
    410: u'资源已经被删除',
    411: u'数据已经存在',
    412: u'数据不存在',

    200: u'auth type unknow',
    201: u'need auth condition',

    210: u'性别修改成功',
    211: u'昵称修改成功',
    212: u'头像修改成功',
}
